9/data/attachments/420694490f0ad57b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>David_analysis_Friend_39902_2</nif:username>
            <nif:friendToBeRequested>soap_friends_57c0ffc4-d148-40b0-9854-4359852bcd50</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>